In [ ]:
"""Q1 List any five functions of the pandas library with execution."""

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
df.dtypes == 'object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [7]:
df.dtypes[df.dtypes == 'object'].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [ ]:
"""Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row."""

In [8]:
df = df.set_index(pd.Index(range(1, 2*len(df)+1, 2)))

In [9]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
3,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
5,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
7,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1773,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
1775,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
1777,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
1779,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
1781,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
"""Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60."""

In [10]:
df1 = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

In [12]:
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [13]:
values_sum = 0
for i, row in df1.iterrows():
    if i < 3:
        values_sum += row['Values']
    else:
        break
print("Sum of the first three values in the 'Values' column:", values_sum)

Sum of the first three values in the 'Values' column: 60

In [ ]:
"""Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column."""

In [14]:
df2 = pd.DataFrame({'Text':['pwskills','ml','ai','ineuron','cv2']})

In [17]:
count_words = lambda text: len(text)
df2['Word_Count'] = df2['Text'].apply(count_words)

In [18]:
df2

       Text  Word_Count
0  pwskills           8
1        ml           2
2        ai           2
3   ineuron           7
4       cv2           3

In [ ]:
"""Q5. How are DataFrame.size() and DataFrame.shape() different?"""

In [19]:
df3 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df3.size)

6

In [20]:
df4 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df4.shape)

(3, 2)

In [ ]:
"""Q6. Which function of pandas do we use to read an excel file?"""

In [ ]:
"""read_excel()"""

In [ ]:
"""Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column."""

In [22]:
df5 = pd.DataFrame({'Email':["pwskills@domain.com","ml@domain.com","ai@domain.com"]})

In [23]:
df5['Username'] = df5['Email'].str.split('@').str[0] 
df5

                 Email  Username
0  pwskills@domain.com  pwskills
1        ml@domain.com        ml
2        ai@domain.com        ai

In [ ]:
"""Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows."""

In [24]:
df6 = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [26]:
df6[(df6['A']>5)  & (df['B'] < 10 )]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
"""Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column."""

In [27]:
df6.mean()

A    5.6
B    4.0
C    3.8
dtype: float64

In [28]:
df6.median()

A    6.0
B    3.0
C    4.0
dtype: float64

In [30]:
df6.std()

A    3.049590
B    3.162278
C    2.387467
dtype: float64

In [ ]:
"""Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day."""

In [31]:
df7 = pd.DataFrame({
    'Sales': [100, 150, 200, 250, 300, 350, 400, 450, 500, 550],
    'Date': pd.date_range('2023-02-01', periods=10, freq='D')
})

In [32]:
df7

   Sales       Date
0    100 2023-02-01
1    150 2023-02-02
2    200 2023-02-03
3    250 2023-02-04
4    300 2023-02-05
5    350 2023-02-06
6    400 2023-02-07
7    450 2023-02-08
8    500 2023-02-09
9    550 2023-02-10

In [33]:
df7['MovingAverage'] = df7['Sales'].rolling(window=7, min_periods=1).mean()

In [34]:
df7

   Sales       Date  MovingAverage
0    100 2023-02-01          100.0
1    150 2023-02-02          125.0
2    200 2023-02-03          150.0
3    250 2023-02-04          175.0
4    300 2023-02-05          200.0
5    350 2023-02-06          225.0
6    400 2023-02-07          250.0
7    450 2023-02-08          300.0
8    500 2023-02-09          350.0
9    550 2023-02-10          400.0

In [ ]:
"""Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column."""

In [35]:
df8 = pd.DataFrame({
    'Date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
})
df8

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [36]:
df8['Date'] = pd.to_datetime(df8['Date'])
df8

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [38]:
df8['Weekday'] = df8['Date'].dt.strftime('%A')
df8

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
'''Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.'''

In [41]:
df9 = pd.DataFrame({
    'Date': pd.date_range('2023-02-01', periods=60, freq='D')
})
df9.head()

        Date
0 2023-02-01
1 2023-02-02
2 2023-02-03
3 2023-02-04
4 2023-02-05

In [44]:
df9.loc[(df9['Date'] >= '2023-02-01') & (df9['Date'] <= '2023-02-28')].head()

        Date
0 2023-02-01
1 2023-02-02
2 2023-02-03
3 2023-02-04
4 2023-02-05

In [ ]:
"""Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?"""

In [ ]:
"""we need to import pandas library and alise the library with pd or whatever you want"""